# UpdatePositionParam

## Description
Using the given position handle, changes the 'Position' parameter for all loads.

```pascal
PROCEDURE UpdatePositionParam(positionHandle : HANDLE);
```

```python

def vs.UpdatePositionParam(positionHandle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|positionHandle|HANDLE||

## Version
Availability: from Vectorworks 2023
## Category
* Truss Analysis